#### Terraform Apply 🎬`success`

<details><summary>Show Result</summary>

```

terraform
local_file.appspec: Refreshing state... [id=1dbb9c90d303cbcfe69db59b8fd829bae08b9b25]
aws_iam_role.codedeploy_role: Refreshing state... [id=demo-fargate-app-codeDeployRole]
aws_ecr_repository.app_repo: Refreshing state... [id=demo-fargate-app]
data.aws_security_group.ecs: Reading...
aws_iam_role.ecs_task_role: Refreshing state... [id=demo-fargate-app-ecsTaskRole]
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Reading...
aws_cloudwatch_log_group.log_group: Refreshing state... [id=demo-fargate-app-logs]
aws_iam_policy.codedeploy_policy: Refreshing state... [id=arn:aws:iam::369168831564:policy/demo-fargate-app-codeDeployPolicy]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=demo-fargate-app-ecsTaskExecutionRole]
aws_codedeploy_app.codedeploy_app: Refreshing state... [id=5cfc974f-1a93-43fe-acc0-7c1d292c8919:demo-fargate-app]
data.aws_vpc.vpc: Reading...
data.aws_resourcegroupstaggingapi_resources.alb: Reading...
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Read complete after 1s [id=aws]
data.aws_resourcegroupstaggingapi_resources.alb: Read complete after 0s [id=aws]
data.aws_lb_listener.alb_listener: Reading...
aws_ecr_lifecycle_policy.repo_policy: Refreshing state... [id=demo-fargate-app]
data.aws_security_group.ecs: Read complete after 1s [id=sg-0a4da3a6cadecdb46]
data.aws_lb_listener.alb_listener: Read complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f]
aws_iam_role_policy_attachment.codedeploy_role_policy_attachment: Refreshing state... [id=demo-fargate-app-codeDeployRole-20230118102048689500000003]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment: Refreshing state... [id=demo-fargate-app-ecsTaskExecutionRole-20230118102048737200000004]
aws_ecs_task_definition.task_def: Refreshing state... [id=demo-fargate-app]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-09588034d45d4bae9]
aws_lb_target_group.bluegreen2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230118102047075700000001/ca2a498b82444cdf]
data.aws_subnets.subnets: Reading...
aws_lb_target_group.bluegreen1: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230118102200245800000001/475e3f3aa8140850]
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
aws_lb_listener_rule.listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f/66b0dac1fc7b6a8b]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:369168831564:service/ecs-fargate/demo-fargate-app]
aws_codedeploy_deployment_group.app_deployment_group: Refreshing state... [id=04c9e90f-bdb9-4b7c-b4b0-525215e7657e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_codedeploy_deployment_group.app_deployment_group will be updated in-place
  ~ resource "aws_codedeploy_deployment_group" "app_deployment_group" {
        id                     = "04c9e90f-bdb9-4b7c-b4b0-525215e7657e"
        tags                   = {}
        # (9 unchanged attributes hidden)

      ~ load_balancer_info {

          ~ target_group_pair_info {

              ~ target_group {
                  ~ name = "tf-20230118102200245800000001" -> "demo-fargate-app-bluegreen1"
                }
              ~ target_group {
                  ~ name = "tf-20230118102047075700000001" -> "demo-fargate-app-bluegreen2"
                }

                # (1 unchanged block hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_def will be updated in-place
  ~ resource "aws_ecs_task_definition" "task_def" {
        id                       = "demo-fargate-app"
      ~ tags                     = {
          ~ "environment" = "" -> "dev"
            # (1 unchanged element hidden)
        }
      ~ tags_all                 = {
          ~ "environment" = "" -> "dev"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # aws_lb_listener_rule.listener_rule will be updated in-place
  ~ resource "aws_lb_listener_rule" "listener_rule" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f/66b0dac1fc7b6a8b"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230118102047075700000001/ca2a498b82444cdf" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.bluegreen1 must be replaced
-/+ resource "aws_lb_target_group" "bluegreen1" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230118102200245800000001/475e3f3aa8140850" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/tf-20230118102200245800000001/475e3f3aa8140850" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230118102200245800000001/475e3f3aa8140850" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "tf-20230118102200245800000001" -> "demo-fargate-app-bluegreen1" # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 5 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "HTTP" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
          ~ unhealthy_threshold = 2 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

      ~ target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_lb_target_group.bluegreen2 must be replaced
-/+ resource "aws_lb_target_group" "bluegreen2" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230118102047075700000001/ca2a498b82444cdf" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/tf-20230118102047075700000001/ca2a498b82444cdf" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230118102047075700000001/ca2a498b82444cdf" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "tf-20230118102047075700000001" -> "demo-fargate-app-bluegreen2" # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 5 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "HTTP" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
          ~ unhealthy_threshold = 2 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }

      ~ target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # local_file.appspec will be created
  + resource "local_file" "appspec" {
      + content              = <<-EOT
            Resources:
              - TargetService:
                  Type: AWS::ECS::Service
                  Properties:
                    TaskDefinition: <TASK_DEFINITION>
                    LoadBalancerInfo:
                      ContainerName: demo-fargate-app
                      ContainerPort: 8080
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../appspec.yaml"
      + id                   = (known after apply)
    }

Plan: 3 to add, 3 to change, 2 to destroy.
local_file.appspec: Creating...
local_file.appspec: Creation complete after 0s [id=1dbb9c90d303cbcfe69db59b8fd829bae08b9b25]
aws_lb_target_group.bluegreen1: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230118102200245800000001/475e3f3aa8140850]
aws_lb_target_group.bluegreen2: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230118102047075700000001/ca2a498b82444cdf]
aws_ecs_task_definition.task_def: Modifying... [id=demo-fargate-app]
aws_ecs_task_definition.task_def: Modifications complete after 0s [id=demo-fargate-app]
aws_lb_target_group.bluegreen1: Destruction complete after 0s
aws_lb_target_group.bluegreen1: Creating...
aws_lb_target_group.bluegreen1: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/demo-fargate-app-bluegreen1/5a4df509caa45828]
aws_lb_listener_rule.listener_rule: Modifying... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f/66b0dac1fc7b6a8b]
aws_lb_listener_rule.listener_rule: Modifications complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f/66b0dac1fc7b6a8b]
aws_lb_target_group.bluegreen2: Destruction complete after 1s
aws_lb_target_group.bluegreen2: Creating...
aws_lb_target_group.bluegreen2: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/demo-fargate-app-bluegreen2/9cb565c0dea75ae2]
aws_codedeploy_deployment_group.app_deployment_group: Modifying... [id=04c9e90f-bdb9-4b7c-b4b0-525215e7657e]
aws_codedeploy_deployment_group.app_deployment_group: Modifications complete after 1s [id=04c9e90f-bdb9-4b7c-b4b0-525215e7657e]

Apply complete! Resources: 3 added, 3 changed, 2 destroyed.

```

</details>
